app/Controllers/Auth.php

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $existingUser = $this->Model_Auth->where('email', $email)->orWhere('nama_user', $nama_user)->first();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'user4@gmail.com'
OR `nama_user` = 'user 4'
 LIMIT 1