app/Models/ModelLokasi.php

    public function getAllData()
    {
        return $this->db->table('tbl_lokasi')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_lokasi`